## OBJETIVO: Identificacion de data
- Columnas clave de negocio
- Tipos de datos
- Posibles columnas para PK/FK
- Calidad de datos (nulos, duplicados, rangos)
- CÃ³mo se relacionan las fuentes

In [3]:
import pandas as pd

In [4]:
RAW_PATH = "../data/raw/"

files = {
    "customers": "customers.csv",
    "employees": "employees.csv",
    "expenses": "expenses.csv",
    "payments": "payments.csv",
    "subscriptions": "subscriptions.csv",
    "transactions": "transactions.csv"
}

dfs = {}

for name, file in files.items():
    df = pd.read_csv(RAW_PATH + file)
    dfs[name] = df
    print(f"\n===== {name.upper()} =====")
    display(df.head())
    print(df.info())
    print(df.describe(include='all'))

===== CUSTOMERS =====

,customer_id,country,acquisition_channel,segment,registration_date
0,Client_001,United States,Paid,Freelancer,2024-07-21 14:05:47
1,Client_002,Costa Rica,Referral,Enterprise,2024-01-21 18:24:51
2,Client_003,Mexico,Organic,Freelancer,2024-09-24 17:10:01
3,Client_004,United States,Organic,Freelancer,2024-02-27 07:34:35
4,Client_005,United States,Organic,SMB,2024-02-15 02:56:46

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer_id          1000 non-null   object
 1   country              1000 non-null   object
 2   acquisition_channel  1000 non-null   object
 3   segment              1000 non-null   object
 4   registration_date    1000 non-null   object
dtypes: object(5)
memory usage: 39.2+ KB
None
       customer_id     country acquisition_channel     segment  \
count         1000        1000                1000        1000
unique        1000           4                   4           3
top     Client_001  Costa Rica             Organic  Enterprise
freq             1         280                 267         343

          registration_date
count                  1000
unique                 1000
top     2024-07-21 14:05:47
freq                      1

===== EMPLOYEES =====

  employee_id       area  salary_usd        country            hire_date
0    Emp_0001  Marketing        5515  United States  2024-01-18 16:35:28
1    Emp_0002  Marketing        7383         Panama  2024-03-08 07:08:28
2    Emp_0003      Sales        7655     Costa Rica  2023-05-22 09:55:38
3    Emp_0004    Finance        5899  United States  2024-08-18 14:48:48
4    Emp_0005    Finance        5534  United States  2024-09-12 23:46:58

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  500 non-null    object
 1   area         500 non-null    object
 2   salary_usd   500 non-null    int64
 3   country      500 non-null    object
 4   hire_date    500 non-null    object
dtypes: int64(1), object(4)
memory usage: 19.7+ KB
None
       employee_id         area   salary_usd     country            hire_date
count          500          500   500.000000         500                  500
unique         500            4          NaN           4                  500
top       Emp_0001  Engineering          NaN  Costa Rica  2024-01-18 16:35:28
freq             1          132          NaN         140                    1
mean           NaN          NaN  4763.328000         NaN                  NaN
std            NaN          NaN  1988.568708         NaN                  NaN
min            NaN          NaN  1006.000000         NaN                  NaN
25%            NaN          NaN  3118.500000         NaN                  NaN
50%            NaN          NaN  4940.000000         NaN                  NaN
75%            NaN          NaN  6475.500000         NaN                  NaN
max            NaN          NaN  7982.000000         NaN                  NaN

===== EXPENSES =====

,expense_id,date,provider,category,amount_usd,country
0,EXP_00001,2024-12-15 12:47:49,Vendor_041,Infrastructure,2259,Mexico
1,EXP_00002,2024-11-21 17:15:37,Vendor_250,Payroll,3284,United States
2,EXP_00003,2024-01-24 23:33:51,Vendor_089,Operations,473,Panama
3,EXP_00004,2024-05-22 20:24:52,Vendor_092,Other,1386,Costa Rica
4,EXP_00005,2024-10-15 07:50:24,Vendor_081,Infrastructure,467,Mexico

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   expense_id  3000 non-null   object
 1   date        3000 non-null   object
 2   provider    3000 non-null   object
 3   category    3000 non-null   object
 4   amount_usd  3000 non-null   int64
 5   country     3000 non-null   object
dtypes: int64(1), object(5)
memory usage: 140.8+ KB
None
       expense_id                 date    provider category   amount_usd  \
count        3000                 3000        3000     3000  3000.000000
unique       3000                 3000         299        5          NaN
top     EXP_00001  2024-12-15 12:47:49  Vendor_227    Other          NaN
freq            1                    1          19      612          NaN
mean          NaN                  NaN         NaN      NaN  2544.235333
std           NaN                  NaN         NaN      NaN  1421.786466
min           NaN                  NaN         NaN      NaN   100.000000
25%           NaN                  NaN         NaN      NaN  1302.750000
50%           NaN                  NaN         NaN      NaN  2531.500000
75%           NaN                  NaN         NaN      NaN  3769.250000
max           NaN                  NaN         NaN      NaN  4995.000000

       country
count     3000
unique       4
top     Mexico
freq       789
mean       NaN
std        NaN
min        NaN
25%        NaN
50%        NaN
75%        NaN
max        NaN

===== PAYMENTS =====

  payment_id transaction_id         payment_date         method  amount_usd
0  PAY_00001       TX_01048  2024-03-18 21:09:07         PayPal          64
1  PAY_00002       TX_01943  2024-04-12 04:34:08    Credit Card         307
2  PAY_00003       TX_03131  2024-04-09 00:59:46  Bank Transfer         248
3  PAY_00004       TX_02797  2024-09-24 06:19:11         PayPal         216
4  PAY_00005       TX_00240  2024-11-08 11:48:35  Bank Transfer         231

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      4000 non-null   object
 1   transaction_id  4000 non-null   object
 2   payment_date    4000 non-null   object
 3   method          4000 non-null   object
 4   amount_usd      4000 non-null   int64
dtypes: int64(1), object(4)
memory usage: 156.4+ KB
None
       payment_id transaction_id         payment_date         method  \
count        4000           4000                 4000           4000
unique       4000           2706                 4000              3
top     PAY_00001       TX_01354  2024-03-18 21:09:07  Bank Transfer
freq            1              5                    1           1391
mean          NaN            NaN                  NaN            NaN
std           NaN            NaN                  NaN            NaN
min           NaN            NaN                  NaN            NaN
25%           NaN            NaN                  NaN            NaN
50%           NaN            NaN                  NaN            NaN
75%           NaN            NaN                  NaN            NaN
max           NaN            NaN                  NaN            NaN

         amount_usd
count   4000.000000
unique          NaN
top             NaN
freq            NaN
mean     263.521500
std      138.413945
min       20.000000
25%      142.000000
50%      269.000000
75%      382.000000
max      499.000000

===== SUBSCRIPTIONS =====

,subscription_id,customer_id,plan,start_date,end_date,status,monthly_price_usd
0,Sub_0001,Client_603,Basic,2024-06-14 01:23:15,2024-01-31 22:32:51,Active,100
1,Sub_0002,Client_354,Standard,2024-08-24 17:11:05,2024-12-15 21:34:31,Active,50
2,Sub_0003,Client_888,Basic,2024-03-17 16:48:44,2024-09-06 10:51:04,Active,30
3,Sub_0004,Client_558,Standard,2024-03-10 23:10:01,2024-02-13 18:18:58,Cancelled,50
4,Sub_0005,Client_550,Standard,2024-09-19 04:49:00,2024-02-26 00:51:16,Active,50

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   subscription_id    2000 non-null   object
 1   customer_id        2000 non-null   object
 2   plan               2000 non-null   object
 3   start_date         2000 non-null   object
 4   end_date           2000 non-null   object
 5   status             2000 non-null   object
 6   monthly_price_usd  2000 non-null   int64
dtypes: int64(1), object(6)
memory usage: 109.5+ KB
None
       subscription_id customer_id     plan           start_date  \
count             2000        2000     2000                 2000
unique            2000         858        3                 1999
top           Sub_0001  Client_833  Premium  2024-10-03 01:13:11
freq                 1           8      695                    2
mean               NaN         NaN      NaN                  NaN
std                NaN         NaN      NaN                  NaN
min                NaN         NaN      NaN                  NaN
25%                NaN         NaN      NaN                  NaN
50%                NaN         NaN      NaN                  NaN
75%                NaN         NaN      NaN                  NaN
max                NaN         NaN      NaN                  NaN

                   end_date  status  monthly_price_usd
count                  2000    2000        2000.000000
unique                 2000       3                NaN
top     2024-01-31 22:32:51  Active                NaN
freq                      1    1472                NaN
mean                    NaN     NaN          96.260000
std                     NaN     NaN          66.746085
min                     NaN     NaN          30.000000
25%                     NaN     NaN          50.000000
50%                     NaN     NaN          50.000000
75%                     NaN     NaN         200.000000
max                     NaN     NaN         200.000000

===== TRANSACTIONS =====

,transaction_id,customer_id,product_id,date,country,quantity,unit_price_usd,total_usd
0,TX_00001,Client_246,Product_049,2024-02-11 23:56:37,Panama,1,75,75
1,TX_00002,Client_568,Product_008,2024-02-18 19:24:07,Costa Rica,2,100,200
2,TX_00003,Client_038,Product_008,2024-10-28 00:43:15,Mexico,2,75,150
3,TX_00004,Client_245,Product_019,2024-05-20 22:48:36,Mexico,2,10,20
4,TX_00005,Client_021,Product_032,2024-01-12 12:03:50,Costa Rica,1,50,50

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  5000 non-null   object
 1   customer_id     5000 non-null   object
 2   product_id      5000 non-null   object
 3   date            5000 non-null   object
 4   country         5000 non-null   object
 5   quantity        5000 non-null   int64
 6   unit_price_usd  5000 non-null   int64
 7   total_usd       5000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 312.6+ KB
None
       transaction_id customer_id   product_id                 date  \
count            5000        5000         5000                 5000
unique           5000         994           49                 5000
top          TX_00001  Client_702  Product_048  2024-02-11 23:56:37
freq                1          14          138                    1
mean              NaN         NaN          NaN                  NaN
std               NaN         NaN          NaN                  NaN
min               NaN         NaN          NaN                  NaN
25%               NaN         NaN          NaN                  NaN
50%               NaN         NaN          NaN                  NaN
75%               NaN         NaN          NaN                  NaN
max               NaN         NaN          NaN                  NaN

              country    quantity  unit_price_usd    total_usd
count            5000  5000.00000     5000.000000  5000.000000
unique              4         NaN             NaN          NaN
top     United States         NaN             NaN          NaN
freq             1291         NaN             NaN          NaN
mean              NaN     2.47100       52.812000   131.050000
std               NaN     1.13834       32.685262   108.008706
min               NaN     1.00000       10.000000    10.000000
25%               NaN     1.00000       25.000000    50.000000
50%               NaN     2.00000       50.000000   100.000000
75%               NaN     3.25000       75.000000   200.000000
max               NaN     4.00000      100.000000   400.000000